#!/bin/bash
#介绍获取一行字符串的三种方法,并展示了linux终端字符颜色的控制字符.
#为了改变linux终端字符颜色,我们需要使用转义序列符.一个转义序列符是一个控制
#命令,它控制shell执行某个特定的命令.一个转义序列符通常以ESC开始,在shell中被
#记录为"^[",有时候也被常常记录为3(因为ESC在ASCII编码中是27,八进制就被记录为
#\033). 那么echo -e "\033[31m"语句中,\033是转义序列符,[表示开始颜色定义,31表
#示红色,m表示设置属性然后结束该转义序列符.

echo -e "\033[31m获取一行字符串的第一种方法:\033[0m"
echo -e "\033[36m请输入一行字符串:\033[0m"
oneline=$(line) #此处也可写成`line`,注意是运行命令的那个反引号
echo -e "\033[34m刚才输入的字符串为:$oneline\033[0m"

echo "******************************"
echo -e "\033[31m获取一行字符串的第二种方法:\033[0m"
echo -e "\033[36m请输入一行字符串:\033[0m"
read oneline
echo -e "\033[34m刚才输入的字符串为:$oneline\033[34m"

echo "******************************"
echo -e "\033[31m获取一行字符串的第三种方法,需要输入文件结束符EOF\033[m"
echo -e "\033[36m请输入一行字符串:\033[0m"
oneline=`cat`
echo -e "\033[34m刚才输入的字符串为:$oneline\033[0m"
