#!/bin/bash
#显示一个蓝色的长方形的改进版本.脚本更简练,输出结果和square.sh脚本一致

square()
{
	echo -ne "\033[0m         "   #9个空格
	echo -e  "\033[44m=================================="   #34个=号

	local i
	for ((i = 0; i != 20; ++i))
	do
		#左边的墙,用两个"||"来表示,而且左边的墙离终端左边9个空格
		echo -ne "\033[0m         \033[44m||" 
		echo -ne "\033[0m                              "    #30个空格
		echo -ne "\033[44m||\n"   #右边的墙,用两个"||"来表示
	done
	echo -ne "\033[0m         "   #9个空格
	echo -e  "\033[44m=================================="   #34个=号
}

clear
square
echo -e "\033[0m"
exit 0
